; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v6 ?v2)
             (pred_6 ?v3 ?v4)
             (pred_8 ?v6 ?v4)
             (pred_3 ?v8 ?v6 )
	     (pred_11 ?v6)
             (pred_7 ?v1)
             (pred_1 ?v3)
             (pred_4 ?v4)
             (pred_9 ?v6)
             (pred_10 ?v3)
             (pred_12 ?v6)
             (pred_5 ))



(:action op_3
:parameters (?v12 ?v9 ?v5 ?v7)
:precondition (and (pred_7 ?v12) (pred_7 ?v9) (pred_1 ?v5) (pred_4 ?v7)
          (pred_2 ?v12 ?v9) (pred_6 ?v5 ?v7)
                   (pred_8 ?v9 ?v7) (pred_11 ?v12) 
                   (pred_9 ?v9) (pred_10 ?v5))
:effect (and  (pred_12 ?v9) (not (pred_9 ?v9))))


(:action op_1
:parameters (?v12 ?v11)
:precondition (and (pred_7 ?v12) (pred_7 ?v11)
               (pred_11 ?v12) (pred_2 ?v12 ?v11) (pred_12 ?v11))
:effect (and (pred_11 ?v11) (not (pred_11 ?v12))))

(:action op_2
:parameters (?v12 ?v5)
:precondition (and (pred_7 ?v12) (pred_1 ?v5) 
                  (pred_11 ?v12) (pred_3 ?v5 ?v12) (pred_5 ))
:effect (and (pred_10 ?v5)
   (not (pred_3 ?v5 ?v12)) (not (pred_5 ))))


(:action op_5
:parameters (?v12 ?v13 ?v10)
:precondition (and (pred_7 ?v12) (pred_1 ?v13) (pred_1 ?v10)
                  (pred_11 ?v12) (pred_10 ?v10) (pred_3 ?v13 ?v12))
:effect (and (pred_10 ?v13) (pred_3 ?v10 ?v12)
        (not (pred_10 ?v10)) (not (pred_3 ?v13 ?v12))))

(:action op_4
:parameters (?v12 ?v5)
:precondition (and (pred_7 ?v12) (pred_1 ?v5) 
                  (pred_11 ?v12) (pred_10 ?v5))
:effect (and (pred_5 ) (pred_3 ?v5 ?v12) (not (pred_10 ?v5)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_03 obj_10 obj_09 obj_02 obj_06 obj_05 obj_11 obj_13
    obj_07 obj_04
    obj_08 obj_12
    )

    (:init
       (pred_5)

       (pred_7 obj_01)
       (pred_7 obj_03)
       (pred_7 obj_10)
       (pred_7 obj_09)
       (pred_7 obj_02)
       (pred_7 obj_06)
       (pred_7 obj_05)
       (pred_7 obj_11)
       (pred_7 obj_13)
       (pred_4 obj_07)
       (pred_4 obj_04)
       (pred_1 obj_08)
       (pred_1 obj_12)

       (pred_2 obj_01 obj_09)
       (pred_2 obj_01 obj_03)
       (pred_2 obj_03 obj_02)
       (pred_2 obj_03 obj_10)
       (pred_2 obj_03 obj_01)
       (pred_2 obj_10 obj_06)
       (pred_2 obj_10 obj_03)
       (pred_2 obj_09 obj_05)
       (pred_2 obj_09 obj_02)
       (pred_2 obj_09 obj_01)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_02 obj_06)
       (pred_2 obj_02 obj_03)
       (pred_2 obj_02 obj_09)
       (pred_2 obj_06 obj_13)
       (pred_2 obj_06 obj_10)
       (pred_2 obj_06 obj_02)
       (pred_2 obj_05 obj_11)
       (pred_2 obj_05 obj_09)
       (pred_2 obj_11 obj_13)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_11 obj_05)
       (pred_2 obj_13 obj_06)
       (pred_2 obj_13 obj_11)
       (pred_9 obj_05)
       (pred_9 obj_11)
       (pred_8  obj_05 obj_07)
       (pred_8  obj_11 obj_04)
       (pred_12 obj_01)
       (pred_12 obj_03)
       (pred_12 obj_10)
       (pred_12 obj_09)
       (pred_12 obj_02)
       (pred_12 obj_06)
       (pred_12 obj_13)

       (pred_6  obj_08 obj_07)
       (pred_6  obj_12 obj_04)
       (pred_3 obj_08 obj_13)
       (pred_3 obj_12 obj_13)
       (pred_11 obj_09)
    )

    (:goal (and
       (pred_3 obj_12 obj_09)
    ))
(:constraints
  (always (not (pred_11 obj_02)))
)
)

; plan
1. (op_1 obj_09 obj_01)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_01)
   goals met: 0 of 1
2. (op_1 obj_01 obj_03)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_03)
   goals met: 0 of 1
3. (op_1 obj_03 obj_10)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_10)
   goals met: 0 of 1
4. (op_1 obj_10 obj_06)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_06)
   goals met: 0 of 1
5. (op_1 obj_06 obj_13)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_13)
   goals met: 0 of 1
6. (op_2 obj_13 obj_12)
   deleted: (pred_3 obj_12 obj_13) (pred_5)
   added: (pred_10 obj_12)
   goals met: 0 of 1
7. (op_1 obj_13 obj_06)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_06)
   goals met: 0 of 1
8. (op_1 obj_06 obj_10)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_10)
   goals met: 0 of 1
9. (op_1 obj_10 obj_03)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_03)
   goals met: 0 of 1
10. (op_1 obj_03 obj_01)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_01)
   goals met: 0 of 1
11. (op_1 obj_01 obj_09)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_09)
   goals met: 0 of 1
12. (op_4 obj_09 obj_12)
   deleted: (pred_10 obj_12)
   added: (pred_5) (pred_3 obj_12 obj_09)
   goals met: 1 of 1
